{   "01":{
        "name": "Glory in Death",
        "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Glory in Death'</strong> reward.</p><p>This reward grants you a second chance to attempt a missed or failed Module Challenge. Here's how to use it:<br>1. The missed Module Challenge will be reopened for you during the preparation week.<br>2. You will receive a notification when the challenge is available for reattempt.<br>3. Complete the challenge before the specified deadline.</p><p>Remember, this is a valuable opportunity to improve your course performance. Prepare well and make the most of it!</p>Don't forget to collect your physical 'Glory in Death' card in your next class session.</p><p>Best of luck with your reattempt!</p>"
    },
    "02":{
        "name": "Mystery Munchies",
        "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Mystery Munchies'</strong> reward.</p><p>Your surprise from the capsule toy machine awaits you! Collect your surprise in person during your next class session. </p><p>We hope this little surprise adds a bit of excitement to your learning journey. </p><p>Don't forget to collect your physical 'Mystery Munchies' card along with your surprise in your next class. </p><p>Enjoy your mystery treat! </p>"
    },
    "05":{
           "name": "Moriarty's Whisper",
           "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Moriarty's Whisper'</strong> reward.</p><p>This reward grants you the opportunity to ask a direct, pointed question about your draft lesson plan or teaching demonstration. Here's how to use it:</p><p>1. Carefully craft your question, ensuring it's specific and focused.<br>2. Reply to this email with your question.<br>3. You'll receive a detailed response from the instructor within 2-3 business days.</p><p>Make the most of this opportunity by asking about an aspect of your work that you find particularly challenging or crucial.</p><p>Remember to collect your physical 'Moriarty's Whisper' cards in your next class session.</p><p>We look forward to receiving your insightful question!</p>"
    },
    "06":{
           "name": "Sand Timer",
           "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Sand Timer'</strong> reward for your group.</p><p>This reward grants your group an extra minute for your teaching demonstration. Here's how it works:</p><p>1. Your group's presentation time will be extended by one minute.<br>2. Bring the reward card in your M5 session<br>3. Inform your instructor at the start of your presentation that you're using the Sand Timer.</p><p>Use this extra time wisely to enhance your teaching demonstration!</p><p>Remember to collect your physical 'Sand Timer' cards in your next class session.</p><p>May this extra minute make a difference in your presentation!</p>"
    },
    "07":{
           "name": "Hidden Gem",
           "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Hidden Gem'</strong> reward for your group.</p><p>This reward grants you access to an archive of exemplary lesson plans from alumni of Moriarty Academy. Here's what you need to know:</p><p>1. Attached to this email is a PDF containing a collection of high-quality lesson plans written by former students. Please enter the passkey “passion” to unlock the file.<br>2. These plans are meant to inspire and guide you, not to be directly copied.<br>3. Use these examples to spark ideas and improve your own lesson planning.</p><p>Remember, while these plans are excellent, they're not perfect. We also updated the rubrics this semester as well. Use them as a starting point to create your own unique and effective lessons.</p><p>Don't forget to collect your physical 'Hidden Gem' cards in your next class session.</p><p>Happy planning, and may these gems inspire your teaching!</p>"
    },
    "08":{
           "name": "Teleport",
           "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Teleport'</strong> reward for your group.</p><p>This reward allows your group to choose your preferred time slot for your teaching demonstration and your time slot is already secured. Make sure to come on your chosen date at the usual class time! </p><p>Don't forget to collect your physical 'Teleport' cards in your next class session.</p><p>Best of luck with your presentation planning!</p>"
    },
    "10":{
           "name": "Potential Bonus Challenge Conquerors!",
           "content": "<p>Congratulations on potentially achieving an impressive accomplishment! We've received notification that your group may have completed all group bonus challenges, unlocking the <strong>'Bonus Challenge Conquerors'</strong> reward.</p><p>This achievement, if confirmed, would demonstrate your group's exceptional dedication, teamwork, and comprehensive engagement with the course material.</p><p>Here's what happens next:<br>1. We will thoroughly review our records to confirm your group's eligibility.<br>2. If confirmed, your group will receive special 'Bonus Challenge Conquerors' cards in the next class session.<br>3. This achievement would then be acknowledged during class.<br></p><p>While this reward doesn't grant additional powers, it stands as a symbol of your group's outstanding commitment and mastery of course content.</p><p>We really appreciate your outstanding effort throughout the course. Regardless of the final confirmation, your dedication is truly admirable.</p><p>We'll update you in the next session about the status of your Bonus Challenge Conquerors reward.</p>"
    },
    "11":{
           "name": "Spectator Mode",
           "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Spectator Mode'</strong> reward.</p><p>This reward allows you to join a peer's teaching demonstration as an observer. Here's how to use it:</p><p>1. Join ONE extra M5 session as an observer with the card. (e.g. If your group is going to present in M5(2), you can choose to come in M5(1) or M5(3) to observe)<br>2. Take notes and prepare constructive feedback for your peers</p><p>This is a valuable opportunity to learn from your peers and gain new perspectives on teaching techniques.</p><p>Remember to collect your physical 'Spectator Mode' card in your next class session.</p><p>Enjoy your spectator experience!</p>"
    },
    "12":{
           "name": "Exodia Unlocked!",
           "content": "<p>Congratulations on potentially achieving an extraordinary feat! We've received notification that you may have unlocked the legendary <strong>'Exodia'</strong> reward by collecting all individual rewards.</p><p>This achievement, if confirmed, would be a testament to your dedication and engagement throughout the course. Exodia symbolizes your mastery of the our gamification system and your comprehensive understanding of the material.</p><p>Here's what happens next:<br>1. We will double-check our records to confirm your eligibility.<br>2. If confirmed, you'll receive the special 'Exodia' card in your next class session.<br>3. Your accomplishment would then be recognized during the class.</p><p>We really appreciate your outstanding effort throughout the course. Regardless of the final confirmation, your dedication is truly admirable.</p><p>We'll update you in the next session about the status of your Exodia reward.</p>"
        },
    "13":{
           "name": "Champ Select",
           "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Champ Select'</strong> reward for your group.</p><p>This reward allows your group to choose your preferred roles for the teaching demonstration. Here's how it works:</p><p>1. Discuss with your group members and decide on your preferred roles (2 facilitators and the others will be model students).<br>2. In your M5 session, bring your reward card and inform your instructor of your chosen role assignments.</p><p><strong>Make sure to discuss your role preferences with your group before the M5 session to ensure everyone agrees on the assignments.</strong> This is a great opportunity to play to each team member's strengths and create a more cohesive teaching demonstration.</p><p>Remember to collect your physical 'Champ Select' cards in your next class session.</p><p>Best of luck with your role selections and presentation planning!</p>"
    },
    "14":{
       "name": "Practice Mode",
       "content": "<p>Thank you for your purchase at The Hidden Tuck Shop! We're excited to confirm that you've successfully acquired the <strong>'Practice Mode</strong>' reward. </p><p>Your 15-minute private session has been scheduled based on your selected time slot. You can check the details in your online shop record.</p><p>If you're planning to practice teaching:<ul><li>Choose any topic you'd like (doesn't have to match your group's topic)</li><li>Submit materials via email 2 days before your session, or bring printed copies</li><li>The instructor will be your model student and provide feedback</li></ul><p>You're also welcome to use this time to familiarize yourself with classroom equipment instead.</p><p><strong>Important: Please arrive 5 minutes early. Late arrivals can only use remaining time in their slot.</strong></p>Don't forget to collect your physical 'Practice Mode' card in your next class session.</p><p>Best of luck with your practice session!</p><p>Best of luck with your role selections and presentation planning!</p>"
    }
}